railsapp/app/controllers/stories_controller.rb

SELECT "stories".* FROM "stories"
---
  def index
    @stories = Story.all

INSERT INTO "stories" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "afrin"], ["content", "pocha"], ["created_at", "2020-05-29 11:01:41.531488"], ["updated_at", "2020-05-29 11:01:41.531488"]]
---
  def create
    @story = Story.new(story_params)

    respond_to do |format|
      if @story.save

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_story
      @story = Story.find(params[:id])